## 1

In [48]:
import pandas as pd

In [49]:
data = pd.read_csv('keywords.csv')
data.head()

         keyword     shows
0             вк  64292779
1  одноклассники  63810309
2          порно  41747114
3           ютуб  39995567
4      вконтакте  21014195

In [50]:
geo_data = {

    'Центр': ['москва', 'тула', 'ярославль'],

    'Северо-Запад': ['петербург', 'псков', 'мурманск'],

    'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']

}

In [51]:
cities = []
for i in geo_data.values():
    cities += i
cities

['москва',
 'тула',
 'ярославль',
 'петербург',
 'псков',
 'мурманск',
 'владивосток',
 'сахалин',
 'хабаровск']

In [52]:
def geo_d(row):
    region = list(geo_data.keys())
    for i in range(len(cities)):
        if cities[i] in row['keyword']:
            for a in range(len(region)):
                if cities[i] in geo_data[region[a]]:
                    key = (region[a])
            return key 
    return 'undefined'

In [53]:
data['region'] = data.apply(geo_d, axis=1)

In [54]:
filtr_data = data[data['region'] != 'undefined' ]
filtr_data.head(25)

,keyword,shows,region
127,авито москва,979292,Центр
370,авито ру санкт петербург,425134,Северо-Запад
564,погода в санкт петербурге,292489,Северо-Запад
849,авито ярославль,209581,Центр
1063,фарпост владивосток,176951,Дальний Восток
1236,банк санкт петербург,174375,Северо-Запад
1259,москва,153050,Центр
1346,санкт петербург,144232,Северо-Запад
1396,гисметео москва,140279,Центр
1482,госуслуги москва,133061,Центр
1579,авито тула,126168,Центр
1682,погода москва,151701,Центр
2121,электронный дневник санкт петербургского образ...,94835,Северо-Запад
2153,авито псков,98931,Северо-Запад
2175,дром хабаровск,98361,Дальний Восток
2398,авито мурманск,89787,Северо-Запад
2550,банк санкт петербург интернет банк,89123,Северо-Запад
2806,циан недвижимость москва,78729,Центр
2974,авто ру санкт петербург,74918,Северо-Запад
3206,дром владивосток,73084,Дальний Восток
3275,100 сп владивосток,76418,Дальний Восток
3687,авито хабаровск,63736,Дальний Восток
3786,метро москва,68024,Центр
4492,авито санкт петербурге,53715,Северо-Запад
4654,леруа мерлен каталог товаров в санкт петербурге,52087,Северо-Запад

In [55]:
grouped = filtr_data.groupby('region').count()
grouped.head()

                keyword  shows
region
Дальний Восток       94     94
Северо-Запад        266    266
Центр               387    387

## 2

In [56]:
data = pd.read_csv('ml-latest-small/ratings.csv')
data.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [57]:
data['rating'] = data['rating'].apply(lambda x: int(x))

In [58]:
def assessment(row):
        if row['rating'] <= 2:
            return 'Low level'

        if row['rating'] <= 4:
            return 'Mid level'

        if row['rating'] > 4:
            return 'High level'

In [80]:
data['class'] = data.apply(assessment , axis = 1)
data.head(10)

   userId  movieId  rating  timestamp       class
0       1        1     4.0  964982703   Mid level
1       1        3     4.0  964981247   Mid level
2       1        6     4.0  964982224   Mid level
3       1       47     5.0  964983815  High level
4       1       50     5.0  964982931  High level
5       1       70     3.0  964982400   Mid level
6       1      101     5.0  964980868  High level
7       1      110     4.0  964982176   Mid level
8       1      151     5.0  964984041  High level
9       1      157     5.0  964984100  High level

In [81]:
data.groupby('class').count()['userId'].head()

class
High level    21762
Low level     13523
Mid level     65551
Name: userId, dtype: int64

## 3

Посчитайте среднее значение Lifetime киноманов (пользователи, которые поставили 100 и более рейтингов). Под Lifetime понимается разница между максимальным и минимальным значением timestamp для каждого пользователя. Ответ дайте в днях.

In [62]:
data = pd.read_csv('ml-latest-small/ratings.csv')
data.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [63]:
grouped_data = data.groupby('userId').count()
grouped_data.head()

        movieId  rating  timestamp
userId
1           232     232        232
2            29      29         29
3            39      39         39
4           216     216        216
5            44      44         44

In [64]:
cinemaddict_data_agg = grouped_data[grouped_data['movieId'] > 100].sort_values('movieId', ascending = False).reset_index()
cinemaddict_data_agg.head()

   userId  movieId  rating  timestamp
0     414     2698    2698       2698
1     599     2478    2478       2478
2     474     2108    2108       2108
3     448     1864    1864       1864
4     274     1346    1346       1346

In [65]:
list_id = cinemaddict_data_agg['userId'].tolist()

In [66]:
cinemaddict_data = data[ data['userId'].isin(list_id) ]
cinemaddict_data.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [67]:
cinemaddict_min_max = cinemaddict_data.groupby('userId').agg(['min','max'])['timestamp'].reset_index()
cinemaddict_min_max.head()

   userId         min         max
0       1   964980499   965719662
1       4   945078428  1007574542
2       6   845553109   845556915
3       7  1106635416  1176181731
4      10  1455301553  1455619275

In [68]:
Lifetime = (cinemaddict_min_max['max'] - cinemaddict_min_max['min']) / 86400
Lifetime.mean()

517.7241635959941

## 4

In [69]:
rating = pd.read_csv('ml-latest-small/ratings.csv')

In [70]:
movies = pd.read_csv(('ml-latest-small/movies.csv'))

In [71]:
years = [str(i) for i in range(1950,2011)]

In [72]:
def production_year(row):
    for year in years:
        if str(year) in row['title']:
            return str(year)
    return 1900

In [73]:
movies['year'] = movies.apply(production_year, axis = 1)

In [74]:
movies.head()

,movieId,title,genres,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

In [75]:
ratings = rating.groupby('movieId').mean()

In [76]:
movies_filt = movies[movies['year'] != 1900 ]

In [77]:
data_joined = rating.merge(movies_filt, on='movieId', how='left')
data_joined.head()

,userId,movieId,rating,timestamp,title,genres,year
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance,1995
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller,1995
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller,1995
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller,1995

In [78]:
mean_year_rating = data_joined.groupby('year').mean()['rating'].reset_index()
mean_year_rating.head()

   year    rating
0  1950  3.813665
1  1951  3.804945
2  1952  3.953125
3  1953  3.647059
4  1954  4.009191

In [79]:
final = mean_year_rating.sort_values('rating', ascending = False)
final.head(60)

    year    rating
7   1957  4.039535
4   1954  4.009191
12  1962  3.969466
2   1952  3.953125
22  1972  3.944293
14  1964  3.940160
24  1974  3.935622
17  1967  3.922572
25  1975  3.879121
8   1958  3.842424
21  1971  3.841463
16  1966  3.823684
0   1950  3.813665
18  1968  3.812212
27  1977  3.810406
1   1951  3.804945
9   1959  3.794239
31  1981  3.760732
26  1976  3.760047
23  1973  3.757764
20  1970  3.754098
15  1965  3.735043
30  1980  3.733581
10  1960  3.721116
5   1955  3.719780
11  1961  3.700000
19  1969  3.682648
6   1956  3.682609
29  1979  3.676845
3   1953  3.647059
33  1983  3.631549
13  1963  3.628920
60  2010  3.569096
59  2009  3.568966
41  1991  3.552265
34  1984  3.529493
58  2008  3.528126
57  2007  3.522433
32  1982  3.510921
54  2004  3.507227
44  1994  3.500944
56  2006  3.499033
49  1999  3.498677
37  1987  3.488312
51  2001  3.482125
39  1989  3.463061
53  2003  3.462321
36  1986  3.460152
28  1978  3.455102
43  1993  3.452152
45  1995  3.443848
35  1985  3.434115
40  1990  3.427310
48  1998  3.427186
38  1988  3.419032
52  2002  3.414584
50  2000  3.398922
55  2005  3.359976
42  1992  3.353555
47  1997  3.347241